aaron-bond.better-comments
akamud.vscode-theme-onedark
bierner.markdown-preview-github-styles
davidanson.vscode-markdownlint
donjayamanne.python-environment-manager
eamodio.gitlens
esbenp.prettier-vscode
fosshaas.fontsize-shortcuts
github.copilot
github.copilot-chat
github.vscode-pull-request-github
markis.code-coverage
mechatroner.rainbow-csv
mgesbert.python-path
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.tensorboard
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
njqdev.vscode-python-typehint
vscode-icons-team.vscode-icons